app/controllers/query_controller.rb

  def index
    reset_session
    @queries = Query.all
---
SELECT "queries".* FROM "queries"

  def show
    @query = Query.find(params[:id])
---
SELECT  "queries".* FROM "queries" WHERE "queries"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    reset_session

    @query = Query.new(input_params)
    @query.save
---
INSERT INTO "queries" ("headphone_type", "bluetooth_weighting", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["headphone_type", "as"], ["bluetooth_weighting", 0], ["created_at", "2019-04-03 15:59:11.771195"], ["updated_at", "2019-04-03 15:59:11.771195"]]